

##
## DEVICE  "EP2C35F672C7"
##


#**************************************************************
# Time Information
#**************************************************************




#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {clk} -period 20.000 -waveform { 0.000 10.000 } [get_ports {CLOCK_50}]


#**************************************************************
# Create Generated Clock
#**************************************************************



#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************



#**************************************************************
# Set Input Delay
#**************************************************************

set_input_delay -clock clk 10 [get_ports SRAM_DQ[*]]

#**************************************************************
# Set Output Delay
#**************************************************************

set_output_delay -clock clk 10 [get_ports SRAM_DQ[*] ]
set_output_delay -clock clk 10 [get_ports SRAM_ADDR[*] ]
set_output_delay -clock clk 10 [get_ports SRAM_UB_N ]
set_output_delay -clock clk 10 [get_ports SRAM_LB_N ]
set_output_delay -clock clk 10 [get_ports SRAM_WE_N ]
set_output_delay -clock clk 10 [get_ports SRAM_CE_N ]
set_output_delay -clock clk 10 [get_ports SRAM_OE_N ]

#**************************************************************
# Set Clock Groups
#**************************************************************


#**************************************************************
# Set False Path
#**************************************************************


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************

